using System.IO;
using System.Security.Policy;
using System.Text;

namespace SchoolRing.Help_info
{
    internal static class HelpInfo
    {
        public const string ChangeClassLength =
            @"•	Избиране на продължителност на час, междучасия и др.
                o	Чрез шаблони:
                    	Изберете между „шаблон 1“ и „шаблон 2“
                o	Чрез ръчно въвеждане на данни:
                    	Натиснете „Персонализирайте стойностите от тук“
                    	Въведете валидни данни за да продължите напред
                ";
        public const string ChooseUser =
            @"•	Избиране на потребителски достъп
                o	За Училище
                    	Дава се достъп до:
                        •	Задаване на неучебни дни/ваканции
                        •	Използване на мелодии за начало и край на час
                        •	Промяна на продължителност на часове и междучасия
                o	За Учител
                    	Дава се достъп до:
                        •	Задаване на неучебни дни/ваканции
                        •	Използване на мелодии за начало и край на час
                        •	Промяна на продължителност на часове и междучасия
                        •	Въвеждане на учебно разписание
                        •	Принтиране на учебно разписание
                        •	Търсачка на учебни часове
                        •	Промяна/Персонализиране на имена на часове
                        •	Сливане на учебни часове
                        •	Записки
                        ";
        public const string SchoolProgram =
            @"•	Въвеждане на седмично учебно разписание
                1.	Избор на учебна смяна
                2.	Избиране на елемент от един от листите с учебни часове
                3.	Ако избраният час е:
                    a.	Свободен
                        i.	Оранжевото поле „Свободен“ е с удебелен шрифт и е отбелязано с тикче
                        ii.	Падащите менюта за избор на клас и паралелка са сиви и неактивни
                        iii.	За да можете да изберете клас и паралелка, премахнете тикчето от „Свободен“
                        iv.	За да запазите промените натиснете бутона „Запази Час“
                    b.	Не е свободен
                        i.	Ако искате да го маркирате като свободен, отбележете с тикче оранжевото поле „Свободен“
                        ii.	Ако желаете да промените клас и паралелка, изберете стойности от жълтите падащи менюта
                        iii.	За да запазите промените натиснете бутона „Запази Час“
                4.	Бутон „Запази Час“ прави валидация на данните преди да направи запис
                5.	Бутон „Напред“ отваря главното меню на приложението
                6.	Бутон „Изчисти разписанието“ маркира всички часове като свободни
                7.	Бутон „Продължи без уч. разписание“ променя  нивото на достъп от „Учител“ на „Училище
                ";
        public const string MergeClasses =
            @"•	Сливане на часове
                o	При избор на ден от седмицата чрез падащо меню се прави автоматична проверка дали има два поредни учебни часа 
                    с един и същ клас и визуализира учебното разписание за деня в листа вдясно
                    	При наличие на два поредни часа с един и същ клас
                        •	В падащото меню „Час 1“ се попълват първите часове от повтарящите се
                        •	При избор на „Час 1“ се попълва автоматично полето „Час 2“ и се маркират в листа вдясно
                        •	При натискане на бутон „Сливане/Разделяне“
                            o	Ако са разделени
                                	Излиза съобщение за успешна операция
                            o	Ако са слети
                                	Излиза диалогов прозорец за потвърждаване на действието
                                	Излиза съобщение за успешна операция
                    	В случай, че няма два поредни часа с един и същ клас
                        •	Излиза съобщение, което уведомява потребителя за липсата на възможност за сливане/разделяне на часове за избрания ден
                ";
        public const string Vacations =
            @"•	Ваканции
                o	Добавяне
                    1.	Избор на дати и въвеждане на име
                    2.	Натискане на кръглия бутон „добави/запиши промени“
                    3.	Валидиране на данни
                    4.	Обратна връзка чрез съобщения
                    5.	Визуализиране на данни за съществуващи ваканции в лист
                o	Редактиране
                    1.	Избор на съществуваща ваканция чрез падащото меню
                    2.	Промяна на данни
                    3.	Натискане на бутона „добави/запиши промени“
                    4.	Валидиране на данни
                    5.	Обратна връзка чрез съобщения
                    6.	Визуализиране на данни за съществуващи ваканции в лист
                o	Премахване
                    1.	Избор на съществуваща ваканция чрез падащото меню
                    2.	Натискане на кръглия бутон „Премахни ваканция“
                o	Принцип на работа
                    	Ако текущият ден е маркиран като ваканция се изключват всички 
                        функции за следене на учебното разписание за деня и възпроизвеждане 
                        на мелодии (ако се използват), като на главното меню излиза надпис 
                        с червен фон „Днес е неучебен ден“ и в горната част на екрана излиза 
                        движещ се надпис с името на ваканцията
                ";
        public const string Melody =
            @"•	Мелодия
                o	Избиране на мелодия
                    	От файл
                        1.	Натиснете синия бутон „избери файл“
                        2.	Локализирайте аудио файла и натиснете „Отвори“
                        3.	При успешно добавяне се визуализира името на файла в бялото поле
                    	От предварително зададените
                        1.	Натиснете синия бутон „🎵“
                        2.	Изберете една от мелодиите
                o	Възпроизвеждане на мелодия
                    	Не може да се възпроизвеждат две мелодии едновременно
                    	Ако мелодията е над една секунда, при достигането до края ѝ, звукът се намаля плавно 
                        докато не спре. По този начин се постига по-приятен за слуха ефект на избеляване на звука
                o	Лимит на продължителност на мелодия
                    	Въведете стойност между „1“ и „99“ в полето за задаване на лимит и натиснете белия бутон „Запази“
                    	Въведете „0“ за премахване на лимита на време за възпроизвеждане на мелодия
                    	Важно! Ако лимитът е по-голям от продължителността на мелодията, възпроизвеждането на мелодията  не се влияе.
                ";
        public const string Printer =
            @"•	Принтер
                1.	Изберете учебна смяна, за която желаете да принтирате учебно разписание
                2.	Изберете място за запазване на .xlsx файла с таблицата (задължително)
                3.	От диалоговия прозорец изберете дали искате да принтирате таблицата сега
                    a.	При избор таблицата да се принтира излиза прозорец за избор на принтер
                    b.	При отказ от принтиране на таблицата се запазва и на екрана излизат 
                        инструкции за ръчно принтиране
                ";
        public const string Search =
            @"•	Търсачка
                o	При въвеждане на клас и/или паралелка излизат всички часове 
                    с този клас/паралелка, подредени по ден от седмицата
                ";
        public const string CustomizeClassName =
            @"•	Промяна на име на час
                o	Тази функционалност позволява клас и паралелка на един час да бъдат заместени с поредица от символи, 
                    което би било полезно при нужда от принтиране на учебно разписание за ученици. Пример: „10Б“ –> „Мат.“
                1.	Изберете ден от седмицата, за да се визуализира лист с учебното разписание 
                2.	Изберете учебен час от падащото меню или директно от листа вдясно за да напишете „ИМЕ“ на часа
                3.	Натиснете бутона „Запази час“, за да запазите промените
                ";

        public const string Notes =
        @"•	Записки
            o	Писане
                    1.	Изберете УЧЕБЕН ден от календара, за да се попълни листът с часовете за съответния ден
                    2.	Изберете час, за който желаете да напишете записки
                        a.	Ако избраният час вече има записани записки, в листа с часовете името му започва с „✏️“
                            и бутонът отдолу се променя от „Писане“ на „Редактиране“
                    3.	Натиснете на оранжевия бутон „Писане“/„Редактиране“
                    4.	Въведете минимум 5 символа
                	Запис
                    1.	Натиснете на зеления бутон „Запази“
                    2.	Ако записът е успешен ще бъдете уведомени със съобщение
                	Изтриване/Отменяне
                    1.	Натиснете червеният бутон „Изтрий“
                        a.	Ако е имало записки преди да редактирате ще излезе диалогов прозорец за потвърждаване 
                            на действието и съобщение за успешно извършена операция
                        b.	Ако не е имало записки преди да натиснете бутона „Пиши“ няма да излезе диалогов прозорец
            o	Търсене
                    	По клас/паралелка
                        o	Излизат намерените записки с първите 5 символа от съдържанието на всеки намерен елемент
                    	По съдържание
                        o	Излизат намерените записки с до 4 символа след първия от входните данни за търсене
                    	И по двата начина при избор на елемент от листа с намерени записки се дава възможност за 
                        редактиране на избраните записки чрез натискане на синия бутон „Редактирай“, който излиза 
                        само при избор на валиден елемент
            o	Визуализация на записки
                    	Ако за текущия час има записки на главното меню излиза голям жълт бутон „Натисни тук за записки“,
                        който след натискане показва записките за часа в съобщение и става сив
            ";
        public const string MainMenu =
            @"•	Главно меню
                o	В полето „Оставащо време“ се визуализира оставащото време от текущ час/междучасие, като ако остава 
                    по-малко от една минута текстът става червен
                o	В полето „Текущ час“ се показва текущ час или „-“, ако няма такъв. Ако в момента по график тече 
                    междучасие, текстът на полето „Текущ час“ става червен
                o	В полето „Оставащи часове“ се изобразява броят на часовете до края на учебния ден, като ако 
                    потребителят е учител се броят само часовете, които не са свободни, а ако е училище, се броят всички
                o	Дава се избор дали да се използва мелодия за начало и край на час, като ако се избере да не се използва,
                    иконата в менюто в горния десен ъгъл се скрива
                ";
    }
}